АлогистикТест2/src/Documents/алк_НормыРасходаИВыпуска/алк_НормыРасходаИВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_НормыРасходаИВыпуска</name>
  <registerRecords>InformationRegister.алк_НормыРасходаИВыпуска</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияE</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияF</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркаАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адгезия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдгезияАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прочность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЭффективногоПоперечногоСечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.алк_ВидДвиженияНормы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистовСорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистовВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КРС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗависимости</name>
      <type>
        <types>EnumRef.алк_ВариантыЗависимостиНормы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_НормыРасходаИВыпуска/алк_НормыРасходаИВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормыРасходаИВыпуска</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВариантЗависимости</name>
    <type>
      <types>EnumRef.алк_ВариантыЗависимостиНормы</types>
    </type>
  </resources>
  <resources>
    <name>ЦелеваяОснование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоменклатураОснование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаОснования</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ВидДвиженияОснования</name>
    <type>
      <types>EnumRef.алк_ВидДвиженияНормы</types>
    </type>
  </resources>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперацияПроизводства</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.алк_ВидДвиженияНормы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидДвиженияНормы/алк_ВидДвиженияНормы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидДвиженияНормы</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_НормыРасходаИВыпуска/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.алк_НормыРасходаИВыпуска.Записывать = Истина;
	Для Каждого ТекСтрокаНормы Из Нормы Цикл
		Движение = Движения.алк_НормыРасходаИВыпуска.Добавить();
		Движение.Период = Дата;   
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;  
		Движение.ДатаОкончанияДействия = ДатаОкончанияДействия;
		Движение.ОперацияПроизводства = Операция;
		Движение.Номенклатура = ТекСтрокаНормы.Номенклатура;
		Движение.Характеристика = ТекСтрокаНормы.Характеристика;
		Движение.ВидДвижения = ТекСтрокаНормы.ВидДвижения;
		Движение.ВариантЗависимости = ТекСтрокаНормы.ВариантЗависимости;
		Движение.НоменклатураОснование = Номенклатура;   
		Движение.ХарактеристикаОснования = Характеристика;
		Движение.ВидДвиженияОснования = Перечисления.алк_ВидДвиженияНормы.Продукция;  
		Движение.ЦелеваяОснование = Целевая;
		Движение.Норма = ТекСтрокаНормы.Норма;
	КонецЦикла;
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Характеристика) И Номенклатура.ИспользоватьХарактеристики Тогда 
		Отказ = Истина;  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка! Учет по номенклатуре ведется в разрезе характеристик. Заполните характеристику.",,Характеристика);
		Возврат;
	КонецЕсли;
КонецПроцедуры
